app/controllers/bg_measurements_controller.rb

  def index
    if current_user
      params[:user_id] = current_user.id
    end
      @bg_measurements = BgMeasurement.where(:user_id => params[:user_id])
---
SELECT "bg_measurements".* FROM "bg_measurements" WHERE "bg_measurements"."user_id" IS NULL

  def show
    @bg_measurement = BgMeasurement.find(params[:id])
---
SELECT "bg_measurements".* FROM "bg_measurements" WHERE "bg_measurements"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @bg_measurement = BgMeasurement.find(params[:id])
---
SELECT "bg_measurements".* FROM "bg_measurements" WHERE "bg_measurements"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    ap params
    extra_param = params[:extra_param]
    @bg_measurement = BgMeasurement.new
    params["bg_measurement"].each do |k,v|
      next if v.blank?
      @bg_measurement.send("#{k}=".to_sym, v)
    end
    @bg_measurement.user_id = current_user.id
    respond_to do |format|
      if @bg_measurement.save
---
INSERT INTO "bg_measurements" ("created_at", "mg_dl", "notes", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Tue, 23 Feb 2016 23:29:32 UTC +00:00], ["mg_dl", 135.0], ["notes", ""], ["updated_at", Tue, 23 Feb 2016 23:29:32 UTC +00:00], ["user_id", 1]]

  def update_location
    puts "update_location. trying to add #{params[:lat]},#{params[:lat]} to bgmeasurement ##{params[:id].to_i}"
    puts "bgmeasurements count = #{BgMeasurement.count}"
    bg_measurement = nil
    15.times do |i|
      puts "attempt #{i} to find record where id = #{params[:id]}"
      bg_measurement = BgMeasurement.find(params[:id].to_i)
      puts "bgmeasurements count = #{BgMeasurement.count}"
      break if bg_measurement
    end
    puts "found record...proceeding"
    puts "\n\n\nID=#{params[:id]}\n\n\n"
    resp = OpenStruct.new
    resp.status = "It worked!"
    resp.lat = params[:lat]
    resp.lng = params[:lng]
    bg_measurement.lat = params[:lat].to_f
    bg_measurement.lng = params[:lng].to_f
    bg_measurement.save
---
SELECT COUNT(*) FROM "bg_measurements"
SELECT "bg_measurements".* FROM "bg_measurements" WHERE "bg_measurements"."id" = ? LIMIT 1  [["id", "41"]]
UPDATE "bg_measurements" SET "lat" = ?, "lng" = ?, "updated_at" = ? WHERE "bg_measurements"."id" = 46  [["lat", 33.9562844], ["lng", -80.3906981], ["updated_at", Thu, 25 Feb 2016 11:21:24 PST -08:00]]