app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'ddd1600@gmail.com' LIMIT 1
---
  def create
    email = params[:email].downcase
    user = User.find_by_email(email)