app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "name", "password_digest", "phone_number", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL ORDER BY "users"."id" ASC LIMIT 1
---
    def set_user
      @user = User.find(params[:id])